Documents/Операция.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>Операция</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.КошелькиПартии</xr:Item>
				<xr:Item>AccumulationRegister.Долги</xr:Item>
				<xr:Item>AccumulationRegister.Кошельки</xr:Item>
				<xr:Item>AccumulationRegister.Затраты</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиВалюты</xr:Item>
				<xr:Item>AccumulationRegister.ПокупкиВалюты</xr:Item>
				<xr:Item>AccumulationRegister.ЗатратыОбщие</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статьи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КошелекПриемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПриемник</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДолга</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДолгов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Метка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Метки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсПрямой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщиеЗатраты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОбщиеЗатраты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДолг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Операция</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчитыватьРасхождениеДолговЗатрат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МеткаОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Метки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ТипыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ТипыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перевод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Долги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сторно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыДолгов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ТипыДолгов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дебет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зачисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Взаимозачет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Операция/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

#Область Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаТаблицаДолги(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаЗатраты(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаЗатратыОбщие(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаКошельки(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаКошелькиПартии(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаПокупкиВалюты(Запрос, ТекстыЗапроса, Регистры);
	ТекстЗапросаТаблицаПродажиВалюты(Запрос, ТекстыЗапроса, Регистры);
	
	ПроведениеСерверУТ.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	ДанныеДокумента.Ссылка КАК Ссылка,
	//|	ДанныеДокумента.ТипОперации КАК ТипОперации,
	//|	ДанныеДокумента.Кошелек КАК Кошелек,
	//|	ДанныеДокумента.Валюта КАК Валюта,
	//|	ДанныеДокумента.Курс КАК Курс,
	//|	ДанныеДокумента.Дата КАК Период
	//|ИЗ
	//|	Документ.Операция КАК ДанныеДокумента
	//|ГДЕ
	//|	ДанныеДокумента.Ссылка = &Ссылка";
	//Реквизиты = Запрос.Выполнить().Выбрать();
	//Реквизиты.Следующий();
	//
	//Запрос.УстановитьПараметр("Период",                                   Реквизиты.Период);
	//Запрос.УстановитьПараметр("Валюта",                                   Реквизиты.Валюта);
	
КонецПроцедуры

Функция ТекстЗапросаТаблицаДолги(Запрос, ТекстыЗапроса, Регистры)
	ИмяРегистра = "Долги";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	Операция.Дата КАК Период,
	|	Операция.ФизЛицо КАК Физлицо,
	|	Операция.Валюта КАК Валюта,
	|	Операция.Метка КАК Метка,
	|	ВЫБОР
	|		КОГДА Операция.СуммаДолг = 0
	|			ТОГДА Операция.Сумма
	|		ИНАЧЕ Операция.СуммаДолг
	|	КОНЕЦ КАК Сумма
	|ИЗ
	|	Документ.Операция КАК Операция
	|ГДЕ
	|	Операция.Ссылка = &Ссылка
	|	И Операция.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОпераций.Долги)
	|	И Операция.ТипДолга В (ЗНАЧЕНИЕ(Перечисление.ТипыДолгов.Дебет), ЗНАЧЕНИЕ(Перечисление.ТипыДолгов.Зачисление))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	Операция.Дата,
	|	Операция.ФизЛицо,
	|	Операция.Валюта,
	|	ЗНАЧЕНИЕ(Справочник.Метки.),
	|	Операция.Сумма - Операция.СуммаДолг
	|ИЗ
	|	Документ.Операция КАК Операция
	|ГДЕ
	|	Операция.Ссылка = &Ссылка
	|	И Операция.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОпераций.Долги)
	|	И Операция.ТипДолга В (ЗНАЧЕНИЕ(Перечисление.ТипыДолгов.Дебет), ЗНАЧЕНИЕ(Перечисление.ТипыДолгов.Зачисление))
	|	И Операция.СуммаДолг <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	Операция.Дата КАК Период,
	|	Операция.ФизЛицо КАК Физлицо,
	|	Операция.Валюта КАК Валюта,
	|	Операция.Метка КАК Метка,
	|	ВЫБОР
	|		КОГДА Операция.СуммаДолг = 0
	|			ТОГДА Операция.Сумма
	|		ИНАЧЕ Операция.СуммаДолг
	|	КОНЕЦ КАК Сумма
	|ИЗ
	|	Документ.Операция КАК Операция
	|ГДЕ
	|	Операция.Ссылка = &Ссылка
	|	И Операция.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОпераций.Долги)
	|	И Операция.ТипДолга В (ЗНАЧЕНИЕ(Перечисление.ТипыДолгов.Кредит), ЗНАЧЕНИЕ(Перечисление.ТипыДолгов.Списание))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	Операция.Дата,
	|	Операция.ФизЛицо,
	|	Операция.Валюта,
	|	ЗНАЧЕНИЕ(Справочник.Метки.),
	|	Операция.Сумма - Операция.СуммаДолг
	|ИЗ
	|	Документ.Операция КАК Операция
	|ГДЕ
	|	Операция.Ссылка = &Ссылка
	|	И Операция.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОпераций.Долги)
	|	И Операция.ТипДолга В (ЗНАЧЕНИЕ(Перечисление.ТипыДолгов.Кредит), ЗНАЧЕНИЕ(Перечисление.ТипыДолгов.Списание))
	|	И Операция.СуммаДолг <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	Операция.Дата,
	|	Операция.ФизЛицо,
	|	Операция.Валюта,
	|	Операция.Метка,
	|	Операция.Сумма
	|ИЗ
	|	Документ.Операция КАК Операция
	|ГДЕ
	|	Операция.Ссылка = &Ссылка
	|	И Операция.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОпераций.Долги)
	|	И Операция.ТипДолга = ЗНАЧЕНИЕ(Перечисление.ТипыДолгов.Взаимозачет)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	Операция.Дата,
	|	Операция.ФизЛицо,
	|	Операция.Валюта,
	|	Операция.МеткаОтправитель,
	|	Операция.Сумма
	|ИЗ
	|	Документ.Операция КАК Операция
	|ГДЕ
	|	Операция.Ссылка = &Ссылка
	|	И Операция.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОпераций.Долги)
	|	И Операция.ТипДолга = ЗНАЧЕНИЕ(Перечисление.ТипыДолгов.Взаимозачет)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Операция.СуммаОбщиеЗатраты - Операция.Сумма >= Операция.СуммаДолг
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	КОНЕЦ,
	|	Операция.Дата,
	|	Операция.ФизЛицо,
	|	Операция.Валюта,
	|	Операция.Метка,
	|	Операция.СуммаДолг
	|ИЗ
	|	Документ.Операция КАК Операция
	|ГДЕ
	|	Операция.Ссылка = &Ссылка
	|	И Операция.ТипОперации В (ЗНАЧЕНИЕ(Перечисление.ТипыОпераций.Расход), ЗНАЧЕНИЕ(Перечисление.ТипыОпераций.Доход))
	|	И Операция.ОбщиеЗатраты
	|	И Операция.СуммаДолг <> 0
	|	И Операция.ФизЛицо <> ЗНАЧЕНИЕ(Справочник.ФизЛица.)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Операция.СуммаОбщиеЗатраты - Операция.Сумма >= Операция.СуммаДолг
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ,
	|	Операция.Дата,
	|	Операция.ФизЛицо,
	|	Операция.Валюта,
	|	Операция.Метка,
	|	Операция.СуммаДолг
	|ИЗ
	|	Документ.Операция КАК Операция
	|ГДЕ
	|	Операция.Ссылка = &Ссылка
	|	И Операция.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОпераций.Сторно)
	|	И Операция.ОбщиеЗатраты
	|	И Операция.СуммаДолг <> 0
	|	И Операция.ФизЛицо <> ЗНАЧЕНИЕ(Справочник.ФизЛица.)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаЗатраты(Запрос, ТекстыЗапроса, Регистры)
	ИмяРегистра = "Затраты";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Операция.Дата КАК Период,
	|	Операция.Статья КАК Статья,
	|	Операция.Валюта КАК Валюта,
	|	Операция.Метка КАК Метка,
	|	Операция.ФизЛицо КАК ФизЛицо,
	|	Операция.Кошелек КАК Кошелек,
	|	ВЫБОР
	|		КОГДА Операция.ТипДолга = ЗНАЧЕНИЕ(Перечисление.ТипыДолгов.Зачисление)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыОпераций.Доход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыОпераций.Расход)
	|	КОНЕЦ КАК ТипОперации,
	|	ВЫБОР
	|		КОГДА Операция.ТипДолга = ЗНАЧЕНИЕ(Перечисление.ТипыДолгов.Зачисление)
	|			ТОГДА Операция.Сумма
	|		ИНАЧЕ -Операция.Сумма
	|	КОНЕЦ КАК Сумма
	|ИЗ
	|	Документ.Операция КАК Операция
	|ГДЕ
	|	Операция.Ссылка = &Ссылка
	|	И Операция.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОпераций.Долги)
	|	И Операция.ТипДолга В (ЗНАЧЕНИЕ(Перечисление.ТипыДолгов.Списание), ЗНАЧЕНИЕ(Перечисление.ТипыДолгов.Зачисление))
	|	И Операция.Статья <> ЗНАЧЕНИЕ(Справочник.Статьи.)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.Дата,
	|	Операция.Статья,
	|	Операция.Валюта,
	|	Операция.Метка,
	|	Операция.ФизЛицо,
	|	Операция.Кошелек,
	|	Операция.ТипОперации,
	|	ВЫБОР
	|		КОГДА Операция.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОпераций.Доход)
	|			ТОГДА Операция.Сумма
	|		ИНАЧЕ -Операция.Сумма
	|	КОНЕЦ
	|ИЗ
	|	Документ.Операция КАК Операция
	|ГДЕ
	|	Операция.Ссылка = &Ссылка
	|	И Операция.ТипОперации В (ЗНАЧЕНИЕ(Перечисление.ТипыОпераций.Доход), ЗНАЧЕНИЕ(Перечисление.ТипыОпераций.Расход))
	|	И НЕ Операция.ОбщиеЗатраты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.Дата,
	|	Операция.Статья,
	|	Операция.Валюта,
	|	Операция.Метка,
	|	Операция.ФизЛицо,
	|	Операция.Кошелек,
	|	Операция.ТипОперации,
	|	ВЫБОР
	|		КОГДА Операция.Основание.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОпераций.Доход)
	|			ТОГДА -Операция.Сумма
	|		ИНАЧЕ Операция.Сумма
	|	КОНЕЦ
	|ИЗ
	|	Документ.Операция КАК Операция
	|ГДЕ
	|	Операция.Ссылка = &Ссылка
	|	И Операция.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОпераций.Сторно)
	|	И НЕ Операция.ОбщиеЗатраты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.Дата,
	|	Операция.Статья,
	|	Операция.Валюта,
	|	Операция.Метка,
	|	Операция.ФизЛицо,
	|	Операция.Кошелек,
	|	Операция.ТипОперации,
	|	ВЫБОР
	|		КОГДА Операция.Сумма = 0
	|			ТОГДА -Операция.СуммаДолг
	|		ИНАЧЕ Операция.СуммаДолг - Операция.Сумма
	|	КОНЕЦ
	|ИЗ
	|	Документ.Операция КАК Операция
	|ГДЕ
	|	Операция.Ссылка = &Ссылка
	|	И Операция.ТипОперации В (ЗНАЧЕНИЕ(Перечисление.ТипыОпераций.Доход), ЗНАЧЕНИЕ(Перечисление.ТипыОпераций.Расход))
	|	И Операция.ОбщиеЗатраты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.Дата,
	|	Операция.Статья,
	|	Операция.Валюта,
	|	Операция.Метка,
	|	Операция.ФизЛицо,
	|	Операция.Кошелек,
	|	Операция.ТипОперации,
	|	ВЫБОР
	|		КОГДА Операция.Сумма = 0
	|			ТОГДА Операция.СуммаДолг
	|		ИНАЧЕ Операция.Сумма - Операция.СуммаДолг
	|	КОНЕЦ
	|ИЗ
	|	Документ.Операция КАК Операция
	|ГДЕ
	|	Операция.Ссылка = &Ссылка
	|	И Операция.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОпераций.Сторно)
	|	И Операция.ОбщиеЗатраты";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаЗатратыОбщие(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ЗатратыОбщие";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Операция.Дата КАК Период,
	|	Операция.Статья КАК Статья,
	|	Операция.Валюта КАК Валюта,
	|	Операция.Метка КАК Метка,
	|	Операция.ФизЛицо КАК ФизЛицо,
	|	Операция.Кошелек КАК Кошелек,
	|	Операция.ТипОперации КАК ТипОперации,
	|	ВЫБОР
	|		КОГДА Операция.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОпераций.Доход)
	|			ТОГДА Операция.СуммаОбщиеЗатраты
	|		ИНАЧЕ -Операция.СуммаОбщиеЗатраты
	|	КОНЕЦ КАК Сумма
	|ИЗ
	|	Документ.Операция КАК Операция
	|ГДЕ
	|	Операция.Ссылка = &Ссылка
	|	И Операция.ТипОперации В (ЗНАЧЕНИЕ(Перечисление.ТипыОпераций.Доход), ЗНАЧЕНИЕ(Перечисление.ТипыОпераций.Расход))
	|	И Операция.ОбщиеЗатраты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.Дата,
	|	Операция.Статья,
	|	Операция.Валюта,
	|	Операция.Метка,
	|	Операция.ФизЛицо,
	|	Операция.Кошелек,
	|	Операция.ТипОперации,
	|	ВЫБОР
	|		КОГДА Операция.Основание.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОпераций.Доход)
	|			ТОГДА -Операция.СуммаОбщиеЗатраты
	|		ИНАЧЕ Операция.СуммаОбщиеЗатраты
	|	КОНЕЦ
	|ИЗ
	|	Документ.Операция КАК Операция
	|ГДЕ
	|	Операция.Ссылка = &Ссылка
	|	И Операция.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОпераций.Сторно)
	|	И Операция.ОбщиеЗатраты";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаКошельки(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "Кошельки";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	Операция.Дата КАК Период,
	|	Операция.Валюта КАК Валюта,
	|	Операция.Кошелек КАК Кошелек,
	|	Операция.Сумма КАК Сумма
	|ИЗ
	|	Документ.Операция КАК Операция
	|ГДЕ
	|	Операция.Ссылка = &Ссылка
	|	И Операция.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОпераций.Доход)
	|	И Операция.Кошелек <> ЗНАЧЕНИЕ(Справочник.Кошельки.)
	|	И Операция.Сумма <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	Операция.Дата,
	|	Операция.Валюта,
	|	Операция.Кошелек,
	|	Операция.Сумма
	|ИЗ
	|	Документ.Операция КАК Операция
	|ГДЕ
	|	Операция.Ссылка = &Ссылка
	|	И Операция.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОпераций.Расход)
	|	И Операция.Кошелек <> ЗНАЧЕНИЕ(Справочник.Кошельки.)
	|	И Операция.Сумма <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	Операция.Дата,
	|	Операция.Валюта,
	|	Операция.Кошелек,
	|	Операция.Сумма
	|ИЗ
	|	Документ.Операция КАК Операция
	|ГДЕ
	|	Операция.Ссылка = &Ссылка
	|	И Операция.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОпераций.Сторно)
	|	И Операция.Основание.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОпераций.Доход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	Операция.Дата,
	|	Операция.Валюта,
	|	Операция.Кошелек,
	|	Операция.Сумма
	|ИЗ
	|	Документ.Операция КАК Операция
	|ГДЕ
	|	Операция.Ссылка = &Ссылка
	|	И Операция.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОпераций.Сторно)
	|	И Операция.Основание.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОпераций.Расход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	Операция.Дата,
	|	Операция.Валюта,
	|	Операция.Кошелек,
	|	Операция.Сумма
	|ИЗ
	|	Документ.Операция КАК Операция
	|ГДЕ
	|	Операция.Ссылка = &Ссылка
	|	И Операция.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОпераций.Перевод)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	Операция.Дата,
	|	Операция.КошелекПриемник.Валюта,
	|	Операция.КошелекПриемник,
	|	Операция.СуммаПриемник
	|ИЗ
	|	Документ.Операция КАК Операция
	|ГДЕ
	|	Операция.Ссылка = &Ссылка
	|	И Операция.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОпераций.Перевод)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	Операция.Дата,
	|	Операция.Валюта,
	|	Операция.Кошелек,
	|	Операция.Сумма
	|ИЗ
	|	Документ.Операция КАК Операция
	|ГДЕ
	|	Операция.Ссылка = &Ссылка
	|	И Операция.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОпераций.Долги)
	|	И Операция.ТипДолга = ЗНАЧЕНИЕ(Перечисление.ТипыДолгов.Дебет)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	Операция.Дата,
	|	Операция.Валюта,
	|	Операция.Кошелек,
	|	Операция.Сумма
	|ИЗ
	|	Документ.Операция КАК Операция
	|ГДЕ
	|	Операция.Ссылка = &Ссылка
	|	И Операция.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОпераций.Долги)
	|	И Операция.ТипДолга = ЗНАЧЕНИЕ(Перечисление.ТипыДолгов.Кредит)";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаКошелькиПартии(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "КошелькиПартии";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	1 КАК Поле1
	|ГДЕ
	|	ЛОЖЬ";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаПокупкиВалюты(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ПокупкиВалюты";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	1 КАК Поле1
	|ГДЕ
	|	ЛОЖЬ";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаПродажиВалюты(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "ПродажиВалюты";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	1 КАК Поле1
	|ГДЕ
	|	ЛОЖЬ";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#КонецОбласти
